# BendingDetailTypeSegmentLengthDimensionsOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BendingDetailTypeSegmentLengthDimensionsOffset Property
ParameterTypeId Class See Also
---
"Dimension Offset"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BendingDetailTypeSegmentLengthDimensionsOffset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BendingDetailTypeSegmentLengthDimensionsOffset As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BendingDetailTypeSegmentLengthDimensionsOffset {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace